{
    "$defs": {
        "Germplasm": {
            "properties": {
                "accessionNumber": {
                    "description": "The unique identifier for a material or germplasm within a genebank\n\nMCPD (v2.1) (ACCENUMB) 2. This is the unique identifier for accessions within a genebank, and is assigned when a sample is entered into the genebank collection (e.g. \"PI 113869\").",
                    "type": [
                        "null",
                        "string"
                    ]
                },
                "acquisitionDate": {
                    "description": "The date a material or germplasm was acquired by the genebank \n\nMCPD (v2.1) (ACQDATE) 12. Date on which the accession entered the collection [YYYYMMDD] where YYYY is the year, MM is the month and DD is the day. Missing data (MM or DD) should be indicated with hyphens or \"00\" [double zero].",
                    "type": [
                        "null",
                        "string"
                    ]
                },
                "additionalInfo": {
                    "description": "A free space containing any additional information related to a particular object. A data source may provide any JSON object, unrestricted by the BrAPI specification.",
                    "$ref": "../BrAPI-Common/AdditionalInfo.json#/$defs/AdditionalInfo",
					"relationshipType": "one-to-one"
                },
                "biologicalStatusOfAccessionCode": {
                    "description": "MCPD (v2.1) (SAMPSTAT) 19. The coding scheme proposed can be used at 3 different levels of detail: either by using the general codes such as 100, 200, 300, 400, or by using the more specific codes such as 110, 120, etc. \n\n100) Wild \n110) Natural \n120) Semi-natural/wild \n130) Semi-natural/sown \n200) Weedy \n300) Traditional cultivar/landrace \n400) Breeding/research material \n410) Breeders line \n411) Synthetic population \n412) Hybrid \n413) Founder stock/base population \n414) Inbred line (parent of hybrid cultivar) \n415) Segregating population \n416) Clonal selection \n420) Genetic stock \n421) Mutant (e.g. induced/insertion mutants, tilling populations) \n422) Cytogenetic stocks (e.g. chromosome addition/substitution, aneuploids,  amphiploids) \n423) Other genetic stocks (e.g. mapping populations) \n500) Advanced or improved cultivar (conventional breeding methods) \n600) GMO (by genetic engineering) \n999) Other (Elaborate in REMARKS field)",
                    "enum": [
                        "100",
                        "110",
                        "120",
                        "130",
                        "200",
                        "300",
                        "400",
                        "410",
                        "411",
                        "412",
                        "413",
                        "414",
                        "415",
                        "416",
                        "420",
                        "421",
                        "422",
                        "423",
                        "500",
                        "600",
                        "999",
                        null
                    ],
                    "type": [
                        "null",
                        "string"
                    ]
                },
                "biologicalStatusOfAccessionDescription": {
                    "description": "Supplemental text description for 'biologicalStatusOfAccessionCode'",
                    "type": [
                        "null",
                        "string"
                    ]
                },
                "breedingMethod": {
                    "$ref": "BreedingMethod.json#/$defs/BreedingMethod",
                    "description": "The unique identifier for the breeding method used to create this germplasm",
                    "referencedAttribute": "germplasm",
                    "relationshipType": "many-to-one"
                },
                "pedigreeNode": {
                    "$ref": "PedigreeNode.json#/$defs/PedigreeNode",
                    "description": "The unique identifier for the node in the pedigree tree associated with a germplasm",
                    "referencedAttribute": "germplasm",
                    "relationshipType": "one-to-one"
                },
                "collection": {
                    "description": "A specific panel/collection/population name this germplasm belongs to.",
                    "type": [
                        "null",
                        "string"
                    ]
                },
                "commonCropName": {
                    "description": "Common name for the crop \n\nMCPD (v2.1) (CROPNAME) 10. Common name of the crop. Example: \"malting barley\", \"mas\".",
                    "type": "string"
                },
                "countryOfOriginCode": {
                    "description": "3-letter ISO 3166-1 code of the country in which the sample was originally collected \n\nMCPD (v2.1) (ORIGCTY) 13. 3-letter ISO 3166-1 code of the country in which the sample was originally collected (e.g. landrace, crop wild relative, farmers variety), bred or selected (breeding lines, GMOs, segregating populations, hybrids, modern cultivars, etc.). Note- Descriptors 14 to 16 below should be completed accordingly only if it was \"collected\".",
                    "type": [
                        "null",
                        "string"
                    ]
                },
                "defaultDisplayName": {
                    "description": "Human readable name used for display purposes",
                    "type": [
                        "null",
                        "string"
                    ]
                },
                "documentationURL": {
                    "description": "A URL to the human readable documentation of an object",
                    "format": "uri",
                    "type": [
                        "null",
                        "string"
                    ]
                },
                "donors": {
                    "description": "List of donor institutes",
                    "relationshipType": "one-to-many",
                    "referencedAttribute": "germplasm",
                    "items": {
                        "$ref": "../BrAPI-Germplasm/Germplasm.json#/$defs/Donor",
                        "description": "Donors"
                    },
                    "title": "Donors",
                    "type": [
                        "null",
                        "array"
                    ]
                },
                "externalReferences": {
                    "description": "An array of external reference ids. These are references to this piece of data in an external system. Could be a simple string or a URI.",
                    "relationshipType": "one-to-many",
                    "items": {
                        "$ref": "../BrAPI-Common/ExternalReference.json#/$defs/ExternalReference",
                        "description": "ExternalReferences"
                    },
                    "title": "ExternalReferences",
                    "type": [
                        "null",
                        "array"
                    ]
                },
                "genus": {
                    "description": "Genus name for taxon. Initial uppercase letter required.\n\nMCPD (v2.1) (GENUS) 5. Genus name for taxon. Initial uppercase letter required.\n\nMIAPPE V1.1 (DM-43) Genus - Genus name for the organism under study, according to standard scientific nomenclature.",
                    "type": [
                        "null",
                        "string"
                    ]
                },
                "germplasmDbId": {
                    "description": "The ID which uniquely identifies a germplasm within the given database server \n<br>MIAPPE V1.1 (DM-41) Biological material ID - Code used to identify the biological material in the data file. Should be unique within the Investigation. Can correspond to experimental plant ID, seed lot ID, etc. This material identification is different from a BiosampleID which corresponds to Observation Unit or Samples sections below.",
                    "type": "string"
                },
                "germplasmName": {
                    "description": "Name of the germplasm. It can be the preferred name and does not have to be unique.\n\nMCPD (v2.1) (ACCENAME) 11. Either a registered or other designation given to the material received, other than the donors accession number (23) or collecting number (3). First letter uppercase. Multiple names are separated by a semicolon without space.",
                    "type": "string"
                },
                "germplasmOrigin": {
                    "description": "Information for material (orchard, natural sites, ...). Geographic identification of the plants from which seeds or cutting have been taken to produce that germplasm.",
                    "relationshipType": "one-to-many",
                    "referencedAttribute": "germplasm",
                    "items": {
                        "$ref": "../BrAPI-Germplasm/Germplasm.json#/$defs/GermplasmOrigin",
                        "description": "GermplasmOrigin"
                    },
                    "title": "GermplasmOrigin",
                    "type": [
                        "null",
                        "array"
                    ]
                },
                "germplasmPUI": {
                    "description": "The Permanent Unique Identifier which represents a germplasm\n\nMIAPPE V1.1 (DM-41) Biological material ID - Code used to identify the biological material in the data file. Should be unique within the Investigation. Can correspond to experimental plant ID, seed lot ID, etc This material identification is different from a BiosampleID which corresponds to Observation Unit or Samples sections below.\n\nMIAPPE V1.1 (DM-51) Material source DOI - Digital Object Identifier (DOI) of the material source\n\nMCPD (v2.1) (PUID) 0. Any persistent, unique identifier assigned to the accession so it can be unambiguously referenced at the global level and the information associated with it harvested through automated means. Report one PUID for each accession. The Secretariat of the International Treaty on Plant Genetic Resources for Food and Agriculture (PGRFA) is facilitating the assignment of a persistent unique identifier (PUID), in the form of a DOI, to PGRFA at the accession level. Genebanks not applying a true PUID to their accessions should use, and request recipients to use, the concatenation of INSTCODE, ACCENUMB, and GENUS as a globally unique identifier similar in most respects to the PUID whenever they exchange information on accessions with third parties.",
                    "type": "string"
                },
                "germplasmPreprocessing": {
                    "description": "Description of any process or treatment applied uniformly to the germplasm, prior to the study itself. Can be provided as free text or as an accession number from a suitable controlled vocabulary.",
                    "type": [
                        "null",
                        "string"
                    ]
                },
                "instituteCode": {
                    "description": "The code for the institute that maintains the material. \n\nMCPD (v2.1) (INSTCODE) 1. FAO WIEWS code of the institute where the accession is maintained. The codes consist of the 3-letter ISO 3166 country code of the country where the institute is located plus a number (e.g. PER001). The current set of institute codes is available from http://www.fao.org/wiews. For those institutes not yet having an FAO Code, or for those with \"obsolete\" codes, see \"Common formatting rules (v)\".",
                    "type": [
                        "null",
                        "string"
                    ]
                },
                "instituteName": {
                    "description": "The name of the institute that maintains the material",
                    "type": [
                        "null",
                        "string"
                    ]
                },
                "pedigree": {
                    "description": "The cross name and optional selection history.\n\nMCPD (v2.1) (ANCEST) 20. Information about either pedigree or other description of ancestral information (e.g. parent variety in case of mutant or selection). For example a pedigree 'Hanna/7*Atlas//Turk/8*Atlas' or a description 'mutation found in Hanna', 'selection from Irene' or 'cross involving amongst others Hanna and Irene'.",
                    "type": [
                        "null",
                        "string"
                    ]
                },
                "seedSource": {
                    "description": "An identifier for the source of the biological material\n<br/>MIAPPE V1.1 (DM-50) Material source ID (Holding institute/stock centre, accession) - An identifier for the source of the biological material, in the form of a key-value pair comprising the name/identifier of the repository from which the material was sourced plus the accession number of the repository for that material. Where an accession number has not been assigned, but the material has been derived from the crossing of known accessions, the material can be defined as follows: \"mother_accession X father_accession\", or, if father is unknown, as \"mother_accession X UNKNOWN\". For in situ material, the region of provenance may be used when an accession is not available.",
                    "type": [
                        "null",
                        "string"
                    ]
                },
                "seedSourceDescription": {
                    "description": "Description of the material source\n\nMIAPPE V1.1 (DM-56) Material source description - Description of the material source",
                    "type": [
                        "null",
                        "string"
                    ]
                },
                "species": {
                    "description": "Specific epithet portion of the scientific name in lowercase letters.\n\nMCPD (v2.1) (SPECIES) 6. Specific epithet portion of the scientific name in lowercase letters. Only the following abbreviation is allowed: \"sp.\" \n\nMIAPPE V1.1 (DM-44) Species - Species name (formally: specific epithet) for the organism under study, according to standard scientific nomenclature.",
                    "type": [
                        "null",
                        "string"
                    ]
                },
                "speciesAuthority": {
                    "description": "The authority organization responsible for tracking and maintaining the species name \n\nMCPD (v2.1) (SPAUTHOR) 7. Provide the authority for the species name.",
                    "type": [
                        "null",
                        "string"
                    ]
                },
                "storageTypes": {
                    "description": "The type of storage this germplasm is kept in at a genebank.",
                    "relationshipType": "one-to-many",
                    "referencedAttribute": "germplasm",
                    "items": {
                        "$ref": "../BrAPI-Germplasm/Germplasm.json#/$defs/StorageType",
                        "description": "StorageTypes"
                    },
                    "title": "StorageTypes",
                    "type": [
                        "null",
                        "array"
                    ]
                },
                "subtaxa": {
                    "description": "Subtaxon can be used to store any additional taxonomic identifier.\n\nMCPD (v2.1) (SUBTAXA) 8. Subtaxon can be used to store any additional taxonomic identifier. The following abbreviations are allowed: \"subsp.\" (for subspecies); \"convar.\" (for convariety); \"var.\" (for variety); \"f.\" (for form); \"Group\" (for \"cultivar group\").\n\nMIAPPE V1.1 (DM-44) Infraspecific name - Name of any subtaxa level, including variety, crossing name, etc. It can be used to store any additional taxonomic identifier. Either free text description or key-value pair list format (the key is the name of the rank and the value is the value of  the rank). Ranks can be among the following terms: subspecies, cultivar, variety, subvariety, convariety, group, subgroup, hybrid, line, form, subform. For MCPD compliance, the following abbreviations are allowed: subsp. (subspecies); convar. (convariety); var. (variety); f. (form); Group (cultivar group).",
                    "type": [
                        "null",
                        "string"
                    ]
                },
                "subtaxaAuthority": {
                    "description": "The authority organization responsible for tracking and maintaining the subtaxon information\n\nMCPD (v2.1) (SUBTAUTHOR) 9. Provide the subtaxon authority at the most detailed taxonomic level.",
                    "type": [
                        "null",
                        "string"
                    ]
                },
                "synonyms": {
                    "description": "List of alternative names or IDs used to reference this germplasm\n\nMCPD (v2.1) (OTHERNUMB) 24. Any other identifiers known to exist in other collections for this accession. Use the following format: INSTCODE:ACCENUMB;INSTCODE:identifier;INSTCODE and identifier are separated by a colon without space. Pairs of INSTCODE and identifier are separated by a semicolon without space. When the institute is not known, the identifier should be preceded by a colon.",
                    "relationshipType": "one-to-many",
                    "referencedAttribute": "germplasm",
                    "items": {
                        "$ref": "../BrAPI-Germplasm/Germplasm.json#/$defs/Synonym",
                        "description": "Synonyms"
                    },
                    "title": "Synonyms",
                    "type": [
                        "null",
                        "array"
                    ]
                },
                "taxonIds": {
                    "description": "The list of IDs for this SPECIES from different sources. If present, NCBI Taxon should be always listed as \"ncbiTaxon\" preferably with a purl. The rank of this ID should be species.\n\nMIAPPE V1.1 (DM-42) Organism - An identifier for the organism at the species level. Use of the NCBI taxon ID is recommended.",
                    "relationshipType": "one-to-many",
                    "referencedAttribute": "germplasm",
                    "items": {
                        "$ref": "../BrAPI-Germplasm/Germplasm.json#/$defs/TaxonId",
                        "description": "TaxonIds"
                    },
                    "title": "TaxonIds",
                    "type": [
                        "null",
                        "array"
                    ]
                },
                "samples": {
                    "title": "samples",
                    "description": "samples",
                    "referencedAttribute": "germplasm",
                    "relationshipType": "one-to-many",
                    "items": {
                        "$ref": "../BrAPI-Genotyping/Sample.json#/$defs/Sample",
                        "description": "Sample"
                    },
                    "type": [
                        "null",
                        "array"
                    ]
                },
                "attributeValues": {
                    "title": "attributeValues",
                    "description": "attributeValues",
                    "referencedAttribute": "germplasm",
                    "relationshipType": "one-to-many",
                    "items": {
                        "$ref": "GermplasmAttributeValue.json#/$defs/GermplasmAttributeValue",
                        "description": "GermplasmAttributeValue"
                    },
                    "type": [
                        "null",
                        "array"
                    ]
                },
                "progenyPedigreeNodes": {
                    "title": "progenyPedigreeNodes",
                    "description": "progenyPedigreeNodes",
                    "relationshipType": "one-to-many",
                    "items": {
                        "$ref": "PedigreeNode.json#/$defs/PedigreeNode",
                        "description": "PedigreeNode"
                    },
                    "type": [
                        "null",
                        "array"
                    ]
                },
                "parentPedigreeNodes": {
                    "title": "parentPedigreeNodes",
                    "description": "parentPedigreeNodes",
                    "relationshipType": "one-to-many",
                    "items": {
                        "$ref": "PedigreeNode.json#/$defs/PedigreeNode",
                        "description": "PedigreeNode"
                    },
                    "type": [
                        "null",
                        "array"
                    ]
                },
                "siblingPedigreeNodes": {
                    "title": "SiblingPedigreeNodes",
                    "description": "siblingPedigreeNodes",
                    "relationshipType": "one-to-many",
                    "items": {
                        "$ref": "PedigreeNode.json#/$defs/PedigreeNode",
                        "description": "PedigreeNode"
                    },
                    "type": [
                        "null",
                        "array"
                    ]
                },
                "observations": {
                    "title": "observations",
                    "description": "observations",
                    "referencedAttribute": "germplasm",
                    "relationshipType": "one-to-many",
                    "items": {
                        "$ref": "../BrAPI-Phenotyping/Observation.json#/$defs/Observation",
                        "description": "Observation"
                    },
                    "type": [
                        "null",
                        "array"
                    ]
                },
                "observationUnits": {
                    "title": "observationUnits",
                    "description": "observationUnits",
                    "referencedAttribute": "germplasm",
                    "relationshipType": "one-to-many",
                    "items": {
                        "$ref": "../BrAPI-Phenotyping/ObservationUnit.json#/$defs/ObservationUnit",
                        "description": "ObservationUnit"
                    },
                    "type": [
                        "null",
                        "array"
                    ]
                }
            },
            "required": [
                "germplasmName",
                "germplasmDbId",
                "germplasmPUI",
                "commonCropName"
            ],
            "title": "Germplasm",
            "type": "object",
            "brapi-metadata": {
                "primaryModel": true
            }
        },
        "Donor": {
            "properties": {
                "donorDbId": {
                    "description": "the unique identifier for a donor",
                    "type": "string"
                },
                "donorAccessionNumber": {
                    "description": "The accession number assigned by the donor\n\nMCPD (v2.1) (DONORNUMB) 23. Identifier assigned to an accession by the donor. Follows ACCENUMB standard.",
                    "type": [
                        "null",
                        "string"
                    ]
                },
                "donorInstituteCode": {
                    "description": "The institute code for the donor institute\n<br/>MCPD (v2.1) (DONORCODE) 22. FAO WIEWS code of the donor institute. Follows INSTCODE standard.",
                    "type": [
                        "null",
                        "string"
                    ]
                },
                "germplasm": {
                    "description": "donoers associated with a germplasm",
                    "$ref": "../BrAPI-Germplasm/Germplasm.json#/$defs/Germplasm",
                    "relationshipType": "many-to-one",
                    "referencedAttribute": "donors"
                }
            },
            "required": [
                "donorDbId"
            ],
            "title": "Donors",
            "type": "object",
            "brapi-metadata": {
                "primaryModel": false
            }
        },
        "GermplasmOrigin": {
            "properties": {
                "germplasmOriginDbId": {
                    "description": "the unique identifier for a origin",
                    "type": "string"
                },
                "coordinateUncertainty": {
                    "description": "Uncertainty associated with the coordinates in meters. Leave the value empty if the uncertainty is unknown.",
                    "type": [
                        "null",
                        "string"
                    ]
                },
                "coordinates": {
                    "description": "One geometry as defined by GeoJSON (RFC 7946). All coordinates are decimal values on the WGS84 geographic coordinate reference system.\n\nCopied from RFC 7946 Section 3.1.1\n\nA position is an array of numbers. There MUST be two or more elements. The first two elements are longitude and latitude, or\neasting and northing, precisely in that order and using decimal numbers. Altitude or elevation MAY be included as an optional third element.",
                    "relationshipType": "one-to-many",
                    "referencedAttribute": "germplasmOrigin",
                    "items": {
                        "$ref": "../BrAPI-Common/GeoJSON.json#/$defs/GeoJSON",
                        "description": "A geometry as defined by GeoJSON (RFC 7946). In this context, only Point or Polygon geometry are allowed."
                    },
                    "title": "GeoJSON",
                    "type": [
                        "null",
                        "array"
                    ]
                },
                "germplasm": {
                    "description": "associated germplasm",
                    "$ref": "../BrAPI-Germplasm/Germplasm.json#/$defs/Germplasm",
                    "relationshipType": "many-to-one",
                    "referencedAttribute": "germplasmOrigin"
                }
            },
            "required": [
                "germplasmOriginDbId"
            ],
            "title": "GermplasmOrigin",
            "type": "object",
            "brapi-metadata": {
                "primaryModel": false
            }
        },
        "StorageType": {
            "properties": {
                "storageTypeDbId": {
                    "description": "the unique identifier for a storage type",
                    "type": "string"
                },
                "code": {
                    "description": "The 2 digit code representing the type of storage this germplasm is kept in at a genebank. \n\nMCPD (v2.1) (STORAGE) 26. If germplasm is maintained under different types of storage, multiple choices are allowed, separated by a semicolon (e.g. 20;30). (Refer to FAO/IPGRI Genebank Standards 1994 for details on storage type.) \n\n10) Seed collection \n11) Short term \n12) Medium term \n13) Long term \n20) Field collection \n30) In vitro collection \n40) Cryo-preserved collection \n50) DNA collection \n99) Other (elaborate in REMARKS field)",
                    "enum": [
                        "10",
                        "11",
                        "12",
                        "13",
                        "20",
                        "30",
                        "40",
                        "50",
                        "99",
                        null
                    ],
                    "type": [
                        "null",
                        "string"
                    ]
                },
                "description": {
                    "description": "A supplemental text description of the storage type",
                    "type": [
                        "null",
                        "string"
                    ]
                },
                "germplasm": {
                    "description": "associated germplasm",
                    "$ref": "../BrAPI-Germplasm/Germplasm.json#/$defs/Germplasm",
                    "relationshipType": "many-to-one",
                    "referencedAttribute": "storageTypes"
                }
            },
            "required": [
                "storageTypeDbId"
            ],
            "title": "StorageTypes",
            "type": "object",
            "brapi-metadata": {
                "primaryModel": false
            }
        },
        "Synonym": {
            "properties": {
                "synonymDbId": {
                    "description": "the unique identifier for a synonym",
                    "type": "string"
                },
                "synonym": {
                    "description": "Alternative name or ID used to reference this germplasm",
                    "type": [
                        "null",
                        "string"
                    ]
                },
                "type": {
                    "description": "A descriptive classification for this synonym",
                    "type": [
                        "null",
                        "string"
                    ]
                },
                "germplasm": {
                    "description": "associated germplasm",
                    "$ref": "../BrAPI-Germplasm/Germplasm.json#/$defs/Germplasm",
                    "relationshipType": "many-to-one",
                    "referencedAttribute": "synonyms"
                }
            },
            "required": [
                "synonymDbId"
            ],
            "title": "Synonyms",
            "type": "object",
            "brapi-metadata": {
                "primaryModel": false
            }
        },
        "TaxonId": {
            "properties": {
                "taxonIdDbId": {
                    "description": "The identifier (name, ID, URI) of a particular taxonomy within the source provider",
                    "type": "string"
                },
                "taxonId": {
                    "description": "The identifier (name, ID, URI) of a particular taxonomy within the source provider",
                    "type": "string"
                },
                "sourceName": {
                    "description": "The human readable name of the taxonomy provider",
                    "type": "string"
                },
                "germplasm": {
                    "description": "associated germplasm",
                    "$ref": "../BrAPI-Germplasm/Germplasm.json#/$defs/Germplasm",
                    "relationshipType": "many-to-one",
                    "referencedAttribute": "taxonIds"
                }
            },
            "required": [
                "sourceName",
                "taxonIdDbId",
                "taxonId"
            ],
            "title": "TaxonIds",
            "type": "object",
            "brapi-metadata": {
                "primaryModel": false
            }
        }
    },
    "$id": "https://brapi.org/Specification/BrAPI-Schema/BrAPI-Germplasm/Germplasm.json",
    "$schema": "http://json-schema.org/draft/2020-12/schema"
}